Repository: RoLex/dcpp
Catalog: installer/po/*.po
Languages: fi, ru

source: DC++ (required)
fi: DC++ (pakollinen)
ru: DC++ (требуется)

source: A previous installation of DC++ has been found; backup settings and queue to '$R0'?
fi: Aikaisempi DC++ asennus löytyi; varmuuskopioidaanko asetukset ja latausjono kansioon '$R0'?
ru: Была обнаружена предыдущая установка DC++. Создать резервную копию настроек и очереди в '$R0'?

source: Start menu shortcuts
fi: Käynnistä-valikon pikakuvakkeet
ru: Ярлыки в меню Пуск

source: Store settings in the user profile directory
fi: Tallenna asetukset käyttäjäprofiilin kansioon
ru: Сохранять настройки в каталоге профиля пользователя

source: Install the 32-bit version
fi: Asenna 32-bittinen versio
ru: Установить 32-битную версию

source: Unchecking this box will make DC++ store its settings in the program directory. This is strongly discouraged on Windows Vista and later; settings or downloads might get lost.
fi: Jos poistat tämän valinnan DC++ tallentaa asetuksensa ohjelman asennuskansioon. Tätä ei suositella Windows Vistassa ja sitä uudemmissa; asetukset tai lataukset voivat kadota.
ru: Если снять этот флажок, DC++ будет хранить свои настройки в каталоге программы. Это крайне не рекомендуется делать в Windows Vista и более поздних версиях; настройки или загрузки могут быть потеряны.

source: Warning: the 'locale' directory ($INSTDIR\locale) will be completely erased!
fi: Varoitus: 'locale' kansio ($INSTDIR\locale) poistetaan kokonaan!
ru: Предупреждение: папка 'locale' ($INSTDIR\locale) будет полностью уничтожена!

source: DC++ (file sharing application)
fi: DC++ (tiedostonjako ohjelma)
ru: DC++ (приложение для обмена файлами)

source: License
fi: Lisenssi
ru: Лицензионное соглашение

source: Help
fi: Ohje
ru: Справка

source: Change Log
fi: Muutosloki
ru: Список изменений

source: Installation complete. Do you want to run DC++?
fi: Asennus on valmis. Haluatko, että DC++ käynnistetään?
ru: Установка завершена. Хотите запустить DC++?

source: Uninstall
fi: Poista asennus
ru: Удаление

source: Also remove queue, settings and the whole DC++ program directory ($INSTDIR) with all of its sub-directories?
fi: Poistetaanko myös latausjono, asetukset ja koko DC++ ohjelman kansio ($INSTDIR) mukaan lukien kaikki sen alikansiot?
ru: Также удалить очередь загрузки, параметры и папку установки DC++ ($INSTDIR) со всеми подпапками?

source: Contribute to the Direct Connect Network Foundation
fi: Tue Direct Connect Network Foundation -organisaatiota
ru: Внести вклад в Direct Connect Network Foundation

source: To help the development of DC++ and other DC related software, please consider contributing or donating. Your generous donations will be used for the following:
fi: Auttaaksesi DC++:n kehitystä ja muita DC:hen liittyviä ohjelmia, harkitse osallistumista tai lahjoitusta. Lahjoituksia käytetään seuraaviin tarkoituksiin:
ru: Чтобы помочь развитию DC++ и других программ, связанных с DC, пожалуйста, внесите свой вклад или сделайте пожертвование. Ваши щедрые донаты будут использованы для следующего:

source: * Development infrastructure (domains, server costs)
fi: Kehityksen infrastruktuuri (domainit, palvelinten kustannukset)
ru: * Инфраструктура разработки (домены, затраты на серверы)

source: * Certificates for supported projects
fi: Certifikaatit tuetuille projekteille
ru: * Сертификаты для поддерживаемых проектов

source: All donations are completly transparent, will be individually listed and published on the DCNF website, either under your own name or as an anonymous donation, according to your choice.
fi: Kaikki lahjoitukset ovat täysin läpinäkyviä, niitä listataan ja julkaistaan yksilöllisesti DCNF:n nettisivuilla nimelläsi, nimimerkillä tai anonyymisti valintasi mukaan.
ru: Все пожертвования абсолютно прозрачны, будут индивидуально занесены в список и опубликованы на сайте DCNF, либо под вашим собственным именем, либо как анонимное пожертвование, в зависимости от вашего выбора.

source: Donate / Contribute
fi: Lahjoita / Osallistu
ru: Пожертвовать/Внести вклад

source: DC++ may not support this version of Windows. Do you want to continue?
fi: DC++ ei välttämättä tue tätä Windowsin versiota. Haluatko jatkaa?
ru: DC++ возможно не поддерживает данную версию Windows. Вы уверены что хотите продолжить?

source: The CPU of this computer is too old to run DC++.
fi: Tämän tietokoneen prosessori (CPU) on liian vanha suorittaakseen DC++-ohjelman.
ru: Главный процессор вашего компютера слишком стар для запуска DC++.
